tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/core"
brew "golang"
brew "dep"
brew "ruby"
brew "python"
brew "nginx"
brew "docker-completion"
brew "docker-compose-completion"
brew "grep", args: ["with-default-names"]
brew "git", args: ["with-blk-sha1", "with-curl", "with-gettext", "with-openssl", "with-pcre2"]
brew "gnu-indent", args: ["with-default-names"]
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar", args: ["with-default-names"]
brew "coreutils", args: ["with-gmp"]
brew "findutils", args: ["with-default-names"]

# json format
brew "jq"

# curl
brew "httpie"

brew "axel"

# pipe views
brew "pv"

brew "rename"
brew "tree"
brew "watch"
brew "autojump"
brew "htop"
brew "gawk"
brew "gcc"
brew "gdb"
brew "wget"

# QR
brew "qrencode"

brew "stormssh"
brew "yarn"
brew "zsh-completions"
cask "qlmarkdown"
cask "quicklook-json"
